<?php
/**
 * Created by PhpStorm.
 * User: shj
 * Date: 2018/10/19
 * Time: 上午11:30
 */

return [
    '10'=>'参数为空或者格式错误',
    '15'=>'请求过多,暂时被限制',



    '10000'=>'用户注册邮箱已被使用',
    '10001'=>'用户登录账号或密码错误',
    '10002'=>'用户不存在',
    '10003'=>'用户登录过期',
    '10004'=>'用户密码错误',
    '10005'=>'用户账号不存在',
    '10006'=>'用户账号被锁定',
    '10010'=>'密码格式错误',




    '19000'=>'文件上传失败',
    '19001'=>'文件分组未找到',
    '19100'=>'文件后缀限制',
    '19101'=>'文件大小限制',
    '19102'=>'文件宽高限制',




    '40000'=>'邮件发送失败',
    '40001'=>'邮件已发送',
    '40002'=>'邮件尚未验证',
    '40003'=>'邮箱验证码错误',
    '40004'=>'邮箱验证码超过验证错误',

    '50000'=>'密码错误',
    '50001'=>'两次密码不相同',

];